a = int(input("나이 입력: "))
print('나이는 ', a+1, '입니다')

#두 정수를 입력 받아 정수의 합을 구해보자

a = int(input('정수1 입력: '))
b = int(input('정수2 입력: '))

total = a + b
print(a, '와', b, '의 합은 =', total,'입니다')

#두 정수를 입력 받아 실수의 합을 구해보자

a = float(input('정수1 입력: '))
b = float(input('정수2 입력: '))

total = a + b
print(a, '와', b, '의 합은 =', total,'입니다')

#연습문제1: 이름과 나이를 받아 출력하는 프로그램
a = str(input('이름: '))
b = int(input('나이: '))
print('이름은', a, '이고', '나이는', b, '입니다')

#연습문제2: 50000원짜리 물건을 할부로 구입한뒤 매달 내는 돈을 꼐산해서 보여주는 프로그램
c = int(input('할부 개월 수: '))
print('결과: 매달내는 돈은', 50000/c, '원 입니다.')



